pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_rodata_0000.c
// bl602_demo_wifi_rodata_0000.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

struct Eq_274 g_t230720F8 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			29555
		},
		
		{
			0x00
		},
		0x6F63,
	};
struct Eq_274 g_t23072184 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x6F63
		},
		
		{
			25445
		},
		26999,
	};
struct Eq_274 g_t230721C4 = 
	{
		99,
		
		{
			25445
		},
		
		{
			0x0A
		},
		
		{
			16731
		},
		8285,
	};
struct Eq_274 g_t230721F0 = 
	{
		99,
		
		{
			25445
		},
		
		{
			0x6573
		},
		
		{
			0x6874
		},
		0x6F66,
	};
struct Eq_274 g_t2307220C = 
	{
		0x6D,
		
		{
			0x203D
		},
		
		{
			0x6D73
		},
		
		{
			29797
		},
		0x6D6F,
	};
struct Eq_274 g_t23072340 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x0D64
		},
		
		{
			0x5041
		},
		0x2020,
	};
struct Eq_274 g_t23072414 = 
	{
		0x49,
		
		{
			0x4320
		},
		
		{
			0x2A2A
		},
		
		{
			0x2A2A
		},
		0x2A2A,
	};
struct Eq_274 g_t230724F0 = 
	{
		114,
		
		{
			0x7361
		},
		
		{
			30018
		},
		
		{
			8292
		},
		25972,
	};
struct Eq_274 g_t23072594 = 
	{
		0x48,
		
		{
			0x2520
		},
		
		{
			0x2067
		},
		
		{
			24435
		},
		0x706F,
	};
struct Eq_274 g_t230725A8 = 
	{
		66,
		
		{
			0x2032
		},
		
		{
			0x2E2E
		},
		
		{
			0x0A
		},
		30309,
	};
struct Eq_274 g_t23072668 = 
	{
		0x5B,
		
		{
			0x4350
		},
		
		{
			0x2065
		},
		
		{
			0x6C69
		},
		0x0A0D,
	};
struct Eq_274 g_t23072694 = 
	{
		0x5B,
		
		{
			0x4350
		},
		
		{
			29284
		},
		
		{
			0x2073
		},
		29477,
	};
struct Eq_274 g_t230726C8 = 
	{
		0x67,
		
		{
			29551
		},
		
		{
			0x202C
		},
		
		{
			0x2072
		},
		0x6425,
	};
struct Eq_274 g_t230726E0 = 
	{
		0x45,
		
		{
			0x2072
		},
		
		{
			0x6425
		},
		
		{
			0x6572
		},
		0x203D,
	};
struct Eq_274 g_t230726F4 = 
	{
		0x53,
		
		{
			29285
		},
		
		{
			0x6F6C
		},
		
		{
			0x6320
		},
		0x656C,
	};
struct Eq_274 g_t23072710 = 
	{
		0x45,
		
		{
			0x2072
		},
		
		{
			11379
		},
		
		{
			0x6570
		},
		0x2520,
	};
struct Eq_274 g_t23072724 = 
	{
		101,
		
		{
			0x0D
		},
		
		{
			0x4547
		},
		
		{
			0x642F
		},
		17199,
	};
struct Eq_274 g_t2307272C = 
	{
		114,
		
		{
			0x203D
		},
		
		{
			17199
		},
		
		{
			25972
		},
		0x6552,
	};
struct Eq_274 g_t23072744 = 
	{
		116,
		
		{
			8300
		},
		
		{
			0x3430
		},
		
		{
			0x3370
		},
		0x5454,
	};
struct Eq_274 g_t2307275C = 
	{
		0x44,
		
		{
			0x6F6C
		},
		
		{
			11878
		},
		
		{
			25646
		},
		0x6164,
	};
struct Eq_274 g_t230727FC = 
	{
		0x0D,
		
		{
			0x7761
		},
		
		{
			29779
		},
		
		{
			25972
		},
		0x6C61,
	};
struct Eq_274 g_t23072808 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x6461
		},
		
		{
			0x2121
		},
		0x00,
	};
struct Eq_274 g_t23072880 = 
	{
		0x53,
		
		{
			8308
		},
		
		{
			0x474D
		},
		
		{
			0x4420
		},
		0x2045,
	};
struct Eq_274 g_t23072898 = 
	{
		0x53,
		
		{
			8308
		},
		
		{
			3443
		},
		
		{
			16731
		},
		8285,
	};
struct Eq_274 g_t230728C0 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x6C25
		},
		
		{
			0x0A0D
		},
		16731,
	};
struct Eq_274 g_t230728E0 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x646C
		},
		
		{
			0x00
		},
		16731,
	};
struct Eq_274 g_t23072BA0 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x616D
		},
		
		{
			0x0A0D
		},
		0x7761,
	};
struct Eq_274 g_t23072BDC = 
	{
		0x5B,
		
		{
			0x5D75
		},
		
		{
			0x6873
		},
		
		{
			0x6F69
		},
		0x6564,
	};
Eq_133241 g_t23072C3C = 
	{
		0x77
	};
struct Eq_274 g_t23072DA8 = 
	{
		77,
		
		{
			0x7972
		},
		
		{
			0x6D69
		},
		
		{
			28448
		},
		0x0A0D,
	};
struct Eq_274 g_t23072DFC = 
	{
		0x54,
		
		{
			20000
		},
		
		{
			26999
		},
		
		{
			0x776F
		},
		0x6E65,
	};
struct Eq_274 g_t23072E0C = 
	{
		0x55,
		
		{
			25972
		},
		
		{
			29285
		},
		
		{
			0x7275
		},
		22337,
	};
struct Eq_274 g_t23072E20 = 
	{
		0x55,
		
		{
			25972
		},
		
		{
			0x6556
		},
		
		{
			0x6F69
		},
		0x6425,
	};
struct Eq_274 g_t23072E34 = 
	{
		0x55,
		
		{
			25972
		},
		
		{
			0x0A
		},
		
		{
			0x722F
		},
		0x7366,
	};
struct Eq_274 g_t23072E80 = 
	{
		0x41,
		
		{
			28489
		},
		
		{
			11892
		},
		
		{
			0x652D
		},
		11636,
	};
struct Eq_274 g_t23072EB8 = 
	{
		0x4F,
		
		{
			0x6320
		},
		
		{
			0x2D2D
		},
		
		{
			0x422D
		},
		0x4E49,
	};
struct Eq_274 g_t23072F08 = 
	{
		0x20,
		
		{
			0x253A
		},
		
		{
			0x4347
		},
		
		{
			21319
		},
		0x4433,
	};
struct Eq_274 g_t23072F14 = 
	{
		44,
		
		{
			0x7472
		},
		
		{
			3394
		},
		
		{
			0x5577
		},
		0x3045,
	};
real32 g_r23073B50 = 1.661321e-07F;
real32 g_r23073E48 = 5.975038e+22F;
real32 g_r23073E4C = 2.119058e+11F;
real32 g_r23073E50 = 1.09024e+21F;
real32 g_r23073E54 = 5.869109e+25F;
struct Eq_274 g_t23073F7C = 
	{
		44,
		
		{
			0x4E49
		},
		
		{
			0x6920
		},
		
		{
			0x6425
		},
		28500,
	};
struct Eq_274 g_t23073F90 = 
	{
		116,
		
		{
			0x2067
		},
		
		{
			3444
		},
		
		{
			0x6874
		},
		0x2067,
	};
struct Eq_274 g_t23073FA8 = 
	{
		44,
		
		{
			0x4E49
		},
		
		{
			0x554E
		},
		
		{
			0x7020
		},
		0x7474,
	};
struct Eq_274 g_t23073FC0 = 
	{
		0x55,
		
		{
			0x656C
		},
		
		{
			0x554E
		},
		
		{
			0x7020
		},
		0x6854,
	};
struct Eq_274 g_t23073FD0 = 
	{
		0x4E,
		
		{
			0x7020
		},
		
		{
			0x2065
		},
		
		{
			0x0A0D
		},
		26707,
	};
struct Eq_274 g_t23073FE0 = 
	{
		0x70,
		
		{
			0x6C20
		},
		
		{
			0x696E
		},
		
		{
			0x0A
		},
		0x7761,
	};
struct Eq_274 g_t23073FF0 = 
	{
		0x54,
		
		{
			0x6F6C
		},
		
		{
			0x6873
		},
		
		{
			0x776F
		},
		0x696E,
	};
struct Eq_274 g_t23074000 = 
	{
		116,
		
		{
			0x2067
		},
		
		{
			28274
		},
		
		{
			25888
		},
		29295,
	};
struct Eq_274 g_t23074014 = 
	{
		0x4E,
		
		{
			0x7020
		},
		
		{
			0x6E69
		},
		
		{
			0x2E2E
		},
		0x00,
	};
struct Eq_274 g_t2307402C = 
	{
		0x4E,
		
		{
			0x7020
		},
		
		{
			29795
		},
		
		{
			0x00
		},
		0x7761,
	};
struct Eq_274 g_t23074044 = 
	{
		0x53,
		
		{
			0x776F
		},
		
		{
			0x6E6F
		},
		
		{
			29795
		},
		29797,
	};
struct Eq_274 g_t23074054 = 
	{
		0x61,
		
		{
			0x6F69
		},
		
		{
			29285
		},
		
		{
			0x2072
		},
		0x202C,
	};
struct Eq_274 g_t2307408C = 
	{
		0x53,
		
		{
			0x776F
		},
		
		{
			0x7274
		},
		
		{
			0x2D20
		},
		11364,
	};
struct Eq_274 g_t230740A0 = 
	{
		0x61,
		
		{
			0x6F69
		},
		
		{
			0x2E2E
		},
		
		{
			0x00
		},
		26707,
	};
struct Eq_274 g_t230740D8 = 
	{
		0x55,
		
		{
			0x656C
		},
		
		{
			0x3D3D
		},
		
		{
			0x3D3D
		},
		0x3D3D,
	};
struct Eq_274 g_t23074114 = 
	{
		0x53,
		
		{
			0x776F
		},
		
		{
			0x3D3D
		},
		
		{
			0x3D3D
		},
		0x3D3D,
	};
struct Eq_274 g_t23074134 = 
	{
		0x3D,
		
		{
			0x3D3D
		},
		
		{
			0x2077
		},
		
		{
			29793
		},
		29477,
	};
struct Eq_274 g_t23074190 = 
	{
		0x4F,
		
		{
			30309
		},
		
		{
			0x2A2A
		},
		
		{
			0x2A2A
		},
		0x2A2A,
	};
struct Eq_274 g_t230741B0 = 
	{
		0x55,
		
		{
			25972
		},
		
		{
			3370
		},
		
		{
			29779
		},
		8299,
	};
struct Eq_274 g_t230741C4 = 
	{
		0x2A,
		
		{
			0x2A2A
		},
		
		{
			0x6F66
		},
		
		{
			24948
		},
		0x2720,
	};
struct Eq_274 g_t23074220 = 
	{
		0x53,
		
		{
			8299
		},
		
		{
			29795
		},
		
		{
			0x7272
		},
		0x2520,
	};
struct Eq_274 g_t23074250 = 
	{
		0x41,
		
		{
			0x7272
		},
		
		{
			0x6425
		},
		
		{
			0x00
		},
		0x6F63,
	};
struct Eq_274 g_t23074274 = 
	{
		0x44,
		
		{
			0x6E6F
		},
		
		{
			0x656C
		},
		
		{
			0x2828
		},
		0x6E69,
	};
struct Eq_274 g_t23074284 = 
	{
		0x44,
		
		{
			0x6E6F
		},
		
		{
			27766
		},
		
		{
			0x6469
		},
		0x206D,
	};
struct Eq_274 g_t2307429C = 
	{
		0x44,
		
		{
			8289
		},
		
		{
			0x3374
		},
		
		{
			10612
		},
		0x3030,
	};
Eq_20444 g_t230742DC = 
	{
		1969516397,
		
		{
			0x5F32
		},
	};
struct Eq_274 g_t23074444 = 
	{
		0x20,
		
		{
			29281
		},
		
		{
			0x3D3D
		},
		
		{
			0x3D3D
		},
		0x0D3D,
	};
struct Eq_274 g_t23074554 = 
	{
		0x20,
		
		{
			0x2520
		},
		
		{
			25665
		},
		
		{
			0x7365
		},
		0x3D3D,
	};
struct Eq_274 g_t230745E4 = 
	{
		0x20,
		
		{
			16717
		},
		
		{
			0x253A
		},
		
		{
			88
		},
		0x7473,
	};
struct Eq_274 g_t2307460C = 
	{
		0x20,
		
		{
			8299
		},
		
		{
			0x7361
		},
		
		{
			29295
		},
		29477,
	};
struct Eq_274 g_t23074630 = 
	{
		0x20,
		
		{
			18771
		},
		
		{
			29295
		},
		
		{
			29795
		},
		29295,
	};
struct Eq_274 g_t2307466C = 
	{
		0x77,
		
		{
			0x656C
		},
		
		{
			29793
		},
		
		{
			0x00
		},
		0x654B,
	};
struct Eq_274 g_t23074684 = 
	{
		0x70,
		
		{
			0x6F77
		},
		
		{
			0x6C20
		},
		
		{
			8308
		},
		25955,
	};
struct Eq_274 g_t23074848 = 
	{
		114,
		
		{
			0x616D
		},
		
		{
			0x7473
		},
		
		{
			28788
		},
		0x2520,
	};
struct Eq_274 g_t23074984 = 
	{
		114,
		
		{
			31073
		},
		
		{
			0x3025
		},
		
		{
			0x2078
		},
		0x7366,
	};
struct Eq_274 g_t23074A18 = 
	{
		0x4E,
		
		{
			0x6F6E
		},
		
		{
			0x6665
		},
		
		{
			0x746C
		},
		31077,
	};
struct Eq_274 g_t23074A30 = 
	{
		0x4E,
		
		{
			0x6F6E
		},
		
		{
			0x0D70
		},
		
		{
			0x2D2D
		},
		0x2D2D,
	};
struct Eq_274 g_t23074A50 = 
	{
		0x25,
		
		{
			0x2570
		},
		
		{
			0x202C
		},
		
		{
			8313
		},
		0x2072,
	};
struct Eq_274 g_t23074A78 = 
	{
		0x2D,
		
		{
			0x2D2D
		},
		
		{
			8313
		},
		
		{
			0x202C
		},
		0x2072,
	};
struct Eq_274 g_t23074AA0 = 
	{
		0x2D,
		
		{
			0x2D2D
		},
		
		{
			0x3D78
		},
		
		{
			0x0A0D
		},
		0x749A,
	};
struct Eq_274 g_t23074ACC = 
	{
		0x2D,
		
		{
			0x2D2D
		},
		
		{
			29285
		},
		
		{
			24948
		},
		0x2073,
	};
struct Eq_274 g_t23074AF4 = 
	{
		0x9A,
		
		{
			0x6E69
		},
		
		{
			0x0D40
		},
		
		{
			0x8480
		},
		0x1A80,
	};
struct Eq_274 g_t23074B00 = 
	{
		0x9A,
		
		{
			0x6572
		},
		
		{
			0x0D40
		},
		
		{
			50000
		},
		0x6572,
	};
struct Eq_274 g_t23074B14 = 
	{
		0x9A,
		
		{
			0x7473
		},
		
		{
			0x00
		},
		
		{
			0x6C62
		},
		24419,
	};
struct Eq_274 g_t23074B34 = 
	{
		0x9A,
		
		{
			29285
		},
		
		{
			0x3220
		},
		
		{
			0x6C62
		},
		24419,
	};
<anonymous> g_t23074B4C = <code>;
<anonymous> * g_a23074D20[] = 
	{
	};
struct Eq_274 g_t230750E0 = 
	{
		0x77,
		
		{
			0x772F
		},
		
		{
			0x253A
		},
		
		{
			0x0A
		},
		0x7077,
	};
struct Eq_274 g_t2307511C = 
	{
		0x77,
		
		{
			0x772F
		},
		
		{
			0x3A70
		},
		
		{
			0x772C
		},
		0x253A,
	};
struct Eq_274 g_t23075154 = 
	{
		0x77,
		
		{
			0x772F
		},
		
		{
			14446
		},
		
		{
			0x312E
		},
		0x7473,
	};
struct Eq_274 g_t23075174 = 
	{
		0x41,
		
		{
			25445
		},
		
		{
			0x6920
		},
		
		{
			0x6765
		},
		0x6120,
	};
struct Eq_274 g_t230751A8 = 
	{
		0x41,
		
		{
			0x6963
		},
		
		{
			0x6961
		},
		
		{
			0x6572
		},
		27735,
	};
struct Eq_274 g_t230751DC = 
	{
		0x44,
		
		{
			0x6920
		},
		
		{
			0x6168
		},
		
		{
			29795
		},
		0x6920,
	};
struct Eq_274 g_t23075204 = 
	{
		0x41,
		
		{
			0x6E65
		},
		
		{
			8292
		},
		
		{
			29477
		},
		0x6E69,
	};
struct Eq_274 g_t2307523C = 
	{
		0x69,
		
		{
			0x7869
		},
		
		{
			0x7865
		},
		
		{
			24436
		},
		0x6469,
	};
struct Eq_274 g_t2307525C = 
	{
		99,
		
		{
			25445
		},
		
		{
			0x6E61
		},
		
		{
			0x2E32
		},
		0x7220,
	};
struct Eq_274 g_t23075288 = 
	{
		0x66,
		
		{
			0x7320
		},
		
		{
			0x7362
		},
		
		{
			24944
		},
		29549,
	};
struct Eq_274 g_t230752B8 = 
	{
		0x44,
		
		{
			0x6874
		},
		
		{
			0x203D
		},
		
		{
			0x0A0D
		},
		0x6572,
	};
struct Eq_274 g_t230752E4 = 
	{
		0x3D,
		
		{
			24948
		},
		
		{
			29555
		},
		
		{
			0x0D20
		},
		0x00,
	};
struct Eq_274 g_t23075318 = 
	{
		115,
		
		{
			0x6863
		},
		
		{
			0x646E
		},
		
		{
			0x6B61
		},
		26996,
	};
struct Eq_274 g_t2307532C = 
	{
		114,
		
		{
			0x746C
		},
		
		{
			0x7275
		},
		
		{
			0x7720
		},
		0x206E,
	};
struct Eq_274 g_t23075348 = 
	{
		115,
		
		{
			0x6863
		},
		
		{
			0x3D20
		},
		
		{
			11381
		},
		0x2020,
	};
struct Eq_274 g_t2307535C = 
	{
		0x3D,
		
		{
			0x646E
		},
		
		{
			0x2020
		},
		
		{
			8313
		},
		0x7420,
	};
struct Eq_274 g_t2307537C = 
	{
		0x34,
		
		{
			8313
		},
		
		{
			0x00
		},
		
		{
			29549
		},
		0x3D21,
	};
struct Eq_274 g_t230753F8 = 
	{
		115,
		
		{
			0x6165
		},
		
		{
			0x7073
		},
		
		{
			0x6E65
		},
		0x6166,
	};
struct Eq_34770 g_t23075444 = 
	{
		0x00,
		&g_t2300E088,
		101,
		0x00,
		101,
	};
struct Eq_34770 g_t2307544C = 
	{
		0x00,
		&g_t2300E0DC,
		0x6165,
		110,
		66,
	};
struct Eq_274 g_t23075454 = 
	{
		0x61,
		
		{
			27757
		},
		
		{
			0xE1E8
		},
		
		{
			29268
		},
		0x00,
	};
<anonymous> g_t23075488 = <code>;
word32 g_dw230754A8 = 0x2300E1D2;
byte g_b23075514 = 0x25;
struct Eq_274 g_t23075518 = 
	{
		0x20,
		
		{
			0x6164
		},
		
		{
			0x00
		},
		
		{
			0x7028
		},
		24438,
	};
word32 g_a230755D4[] = 
	{
	};
Eq_363020 g_a230759D4[] = 
	{
	};
Eq_8717 g_t23075B84 = 
	{
		?? /* Can't read address 460EB708 */
,
	};
Eq_36364 g_t23075D34 = 
	{
		0x24,
	};
byte g_a23075D3C[] = 
	{
	};
byte g_b23075D64 = 0x25;
Eq_2 g_t23075D6C = 
	{
		0x746E
	};
byte g_b23075D78 = 0x25;
struct Eq_274 g_t23075FE4 = 
	{
		115,
		
		{
			0x656B
		},
		
		{
			0x253A
		},
		
		{
			27424
		},
		0x695F,
	};
struct Eq_274 g_t23076030 = 
	{
		115,
		
		{
			0x666D
		},
		
		{
			25888
		},
		
		{
			0x6E61
		},
		0x6E6F,
	};
struct Eq_274 g_t23076080 = 
	{
		0x6D,
		
		{
			0x7768
		},
		
		{
			0x4672
		},
		
		{
			0x6873
		},
		0x7075,
	};
word32 g_a23076448[65] = 
	{
		0x428A2F98,
		1899447441,
		~0x4A3F0430,
		~0x164A245A,
		961987163,
		0x59F111F1,
		2453635748,
		2870763221,
		0xD807AA98,
		0x12835B01,
		607225278,
		0x550C7DC3,
		1925078388,
		2162078206,
		2614888103,
		3248222580,
		3835390401,
		4022224774,
		264347078,
		0x240CA1CC,
		770255983,
		0x4A7484AA,
		0x5CB0A9DC,
		1996064986,
		2554220882,
		2821834349,
		2952996808,
		3210313671,
		0xC6E00BF3,
		3584528711,
		113926993,
		0x14292967,
		666307205,
		773529912,
		1294757372,
		0x53380D13,
		0x650A7354,
		0x766A0ABB,
		0x81C2C92E,
		0x92722C85,
		~0x5D40175E,
		2820302411,
		0xC24B8B70,
		3345764771,
		0xD192E819,
		0xD6990624,
		4094571909,
		0x106AA070,
		430227734,
		506948616,
		659060556,
		883997877,
		0x391C0CB3,
		1322822218,
		1537002063,
		1747873779,
		1955562222,
		2024104815,
		2227730452,
		0x8CC70208,
		2428436474,
		0xA4506CEB,
		3204031479,
		3329325298,
		1215001703,
	};
Eq_2 g_a23076570[] = 
	{
	};
Eq_5614 g_t2307676C = 
	{
		0x40000000
	};
Eq_5614 g_t23076770 = 
	{
		0xC0000000
	};
real32 g_r23076774 = 5.0F;
real32 g_r23076778 = -5.0F;
Eq_2 g_t23076780 = 
	{
		0x00
	};
Eq_2 g_t23076784 = 
	{
		0x00
	};
Eq_2 g_t23076788 = 
	{
		0x00
	};
Eq_2 g_t2307678C = 
	{
		0x00
	};
Eq_2 g_t23076790 = 
	{
		0x6666
	};
Eq_2 g_t23076794 = 
	{
		0x6666
	};
Eq_2 g_t23076798 = 
	{
		0x00
	};
Eq_2 g_t2307679C = 
	{
		0x00
	};
Eq_2 g_t230767A0 = 
	{
		0x00
	};
Eq_2 g_t230767A4 = 
	{
		0x1000
	};
Eq_64619 g_t230767A8 = 
	{
		0
	};
Eq_64620 g_t230767AC = 
	{
		0x3FE00000
	};
Eq_2 g_t23076FB0 = 
	{
		0x00
	};
Eq_2 g_t23076FB4 = 
	{
		0x12D0
	};
Eq_2 g_t23076FB8 = 
	{
		0x00
	};
Eq_2 g_t23076FBC = 
	{
		0x00
	};
struct Eq_274 g_t23077024 = 
	{
		0x4C,
		
		{
			25455
		},
		
		{
			0x656E
		},
		
		{
			25202
		},
		0x6163,
	};
struct Eq_274 g_t23077070 = 
	{
		0x25,
		
		{
			0x2068
		},
		
		{
			0x0A
		},
		
		{
			20972
		},
		~0x147A,
	};
struct Eq_274 g_t23077090 = 
	{
		110,
		
		{
			25202
		},
		
		{
			0x6F72
		},
		
		{
			0x6361
		},
		26463,
	};
struct Eq_274 g_t23077094 = 
	{
		114,
		
		{
			0x6163
		},
		
		{
			0x6361
		},
		
		{
			26463
		},
		9533,
	};
Eq_2 g_t230770E0 = 
	{
		20972
	};
Eq_2 g_t230770E4 = 
	{
		~0x147A
	};
struct Eq_274 g_t230770E8 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			26463
		},
		
		{
			9533
		},
		0x0A0D,
	};
struct Eq_274 g_t230770FC = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			26463
		},
		
		{
			9533
		},
		0x0A0D,
	};
struct Eq_274 g_t23077110 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			26463
		},
		
		{
			9533
		},
		0x0A0D,
	};
struct Eq_274 g_t23077124 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			0x7473
		},
		
		{
			9533
		},
		0x612C,
	};
struct Eq_274 g_t23077138 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			0x6C25
		},
		
		{
			0x0A
		},
		28532,
	};
struct Eq_274 g_t2307714C = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			0x742C
		},
		
		{
			0x6164
		},
		0x3D71,
	};
struct Eq_274 g_t23077160 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			0x6167
		},
		
		{
			0x635F
		},
		0x3D70,
	};
struct Eq_274 g_t23077174 = 
	{
		114,
		
		{
			0x6361
		},
		
		{
			0x6870
		},
		
		{
			24421
		},
		0x706D,
	};
struct Eq_274 g_t23077188 = 
	{
		0x61,
		
		{
			0x6C25
		},
		
		{
			~0x0F
		},
		
		{
			~0x0C
		},
		~0x09,
	};
struct Eq_274 g_t230771AC = 
	{
		116,
		
		{
			0x6361
		},
		
		{
			0x07
		},
		
		{
			0x09
		},
		11,
	};
word32 * g_a230771F4[15] = 
	{
		&g_dwFFFFFFF0,
		&g_dwFFFFFFF3,
		&g_dwFFFFFFF6,
		&g_dwFFFFFFF8,
		&g_dwFFFFFFFB,
		&g_dwFFFFFFFE,
		null,
		&g_dw0002,
		&g_dw0005,
		&g_dw0007,
		&g_dw0009,
		&g_dw000B,
		&g_dw000E,
		&g_dw0012,
		null,
	};
Eq_79026 g_t230779F8 = 
	{
		0x6863616D,
	};
struct Eq_274 g_t23077F68 = 
	{
		0x5B,
		
		{
			23328
		},
		
		{
			0x2930
		},
		
		{
			0x3D3D
		},
		0x00,
	};
real32 g_r23077FC0 = 1.852353e+25F;
real32 g_r23077FC4 = 1.044564e-08F;
real32 g_r23077FC8 = 6.164722e-10F;
real32 g_r23077FCC = 7.101089e-10F;
real32 g_r23077FD0 = 6.409691e-10F;
real32 g_r23077FD4 = 1.432848e-19F;
real32 g_r23077FD8 = 5.829469e-10F;
struct Eq_274 g_t2307804C = 
	{
		0x6D,
		
		{
			0x5F77
		},
		
		{
			~0x48F1
		},
		
		{
			0x10
		},
		0xB8E0,
	};
struct Eq_274 g_t230783B8 = 
	{
		0x25,
		
		{
			0x7361
		},
		
		{
			25455
		},
		
		{
			0x6341
		},
		0x6544,
	};
struct Eq_274 g_t23078440 = 
	{
		0x2D,
		
		{
			0x2D2D
		},
		
		{
			0x7372
		},
		
		{
			29989
		},
		0x00,
	};
struct Eq_274 g_t230784B8 = 
	{
		0x2D,
		
		{
			0x2D2D
		},
		
		{
			29285
		},
		
		{
			0x2520
		},
		0x0A,
	};
struct Eq_274 g_t23078530 = 
	{
		0x55,
		
		{
			0x2067
		},
		
		{
			~0x202B
		},
		
		{
			0x1407
		},
		58242,
	};
struct Eq_274 g_t23078624 = 
	{
		115,
		
		{
			0x6320
		},
		
		{
			0x7362
		},
		
		{
			0x2964
		},
		18011,
	};
struct Eq_274 g_t23078698 = 
	{
		0x5B,
		
		{
			0x7020
		},
		
		{
			16991
		},
		
		{
			0x505F
		},
		19777,
	};
struct Eq_274 g_t230788EC = 
	{
		99,
		
		{
			25445
		},
		
		{
			~0x1849
		},
		
		{
			0x15
		},
		~0x1849,
	};
struct Eq_274 g_t23078A2C = 
	{
		0x5B,
		
		{
			0x7220
		},
		
		{
			0x5320
		},
		
		{
			0x6964
		},
		0x4120,
	};
struct Eq_274 g_t23078A44 = 
	{
		0x25,
		
		{
			0x0D64
		},
		
		{
			0x00
		},
		
		{
			0x6F63
		},
		29545,
	};
struct Eq_274 g_t23078A4C = 
	{
		0x25,
		
		{
			0x7061
		},
		
		{
			29545
		},
		
		{
			29545
		},
		0x706D,
	};
struct Eq_274 g_t23078A70 = 
	{
		0x5B,
		
		{
			0x7220
		},
		
		{
			27432
		},
		
		{
			0x7473
		},
		24421,
	};
struct Eq_274 g_t23078A94 = 
	{
		0x5B,
		
		{
			0x5320
		},
		
		{
			0x5241
		},
		
		{
			0x535F
		},
		0x4954,
	};
struct Eq_274 g_t23078B94 = 
	{
		117,
		
		{
			0x6B63
		},
		
		{
			0x203A
		},
		
		{
			3445
		},
		0x2020,
	};
byte g_a23078CC4[] = 
	{
	};
word32 g_a23078D14[] = 
	{
	};
int32 g_a23079114[] = 
	{
	};
word32 g_a23079514[] = 
	{
	};
int32 g_a23079914[] = 
	{
	};
int32 g_a23079E14[] = 
	{
	};
word32 g_a2307A214[] = 
	{
	};
int32 g_a2307A614[] = 
	{
	};
struct Eq_97581 * g_a2307AA14[] = 
	{
	};
struct Eq_274 g_t2307B02C = 
	{
		0x50,
		
		{
			0x4D20
		},
		
		{
			0x28B8
		},
		
		{
			0x28B8
		},
		0xB138,
	};
struct Eq_274 g_t2307B068 = 
	{
		0x52,
		
		{
			0x5220
		},
		
		{
			18002
		},
		
		{
			0x4F
		},
		18002,
	};
struct Eq_274 g_t2307B07C = 
	{
		0x0D,
		
		{
			0x00
		},
		
		{
			88
		},
		
		{
			18002
		},
		0x5232,
	};
struct Eq_274 g_t2307B144 = 
	{
		0x5B,
		
		{
			8285
		},
		
		{
			0x525F
		},
		
		{
			0x203A
		},
		24417,
	};
int32 g_dw2307B184 = 3;
struct Eq_274 g_t2307B1A0 = 
	{
		0x5B,
		
		{
			0x4120
		},
		
		{
			0x535F
		},
		
		{
			0x5452
		},
		0x5145,
	};
struct Eq_274 g_t2307B1D4 = 
	{
		0x5B,
		
		{
			0x4120
		},
		
		{
			0x695F
		},
		
		{
			0x6920
		},
		0x3025,
	};
struct Eq_274 g_t2307B204 = 
	{
		0x5B,
		
		{
			0x4120
		},
		
		{
			24419
		},
		
		{
			0x2078
		},
		0x2520,
	};
struct Eq_274 g_t2307B220 = 
	{
		0x5B,
		
		{
			0x7320
		},
		
		{
			0x5F50
		},
		
		{
			0x2051
		},
		0x646E,
	};
struct Eq_274 g_t2307B238 = 
	{
		0x5B,
		
		{
			0x7620
		},
		
		{
			0x646E
		},
		
		{
			0x2520
		},
		0x0A,
	};
struct Eq_274 g_t2307B250 = 
	{
		0x5B,
		
		{
			0x6320
		},
		
		{
			0x5F50
		},
		
		{
			0x2051
		},
		0x656E,
	};
struct Eq_274 g_t2307B268 = 
	{
		0x5B,
		
		{
			0x6220
		},
		
		{
			22363
		},
		
		{
			0x4D20
		},
		0x4441,
	};
struct Eq_274 g_t2307B280 = 
	{
		0x5B,
		
		{
			0x4120
		},
		
		{
			0x676E
		},
		
		{
			29477
		},
		0x00,
	};
struct Eq_274 g_t2307B2B0 = 
	{
		0x5B,
		
		{
			0x4120
		},
		
		{
			29477
		},
		
		{
			29779
		},
		0x7375,
	};
struct Eq_274 g_t2307B2D4 = 
	{
		0x5B,
		
		{
			0x4D20
		},
		
		{
			0x7865
		},
		
		{
			0x6F72
		},
		16716,
	};
struct Eq_274 g_t2307B2F8 = 
	{
		0x5B,
		
		{
			0x4D20
		},
		
		{
			0x4556
		},
		
		{
			0x5F46
		},
		0x2051,
	};
struct Eq_274 g_t2307B31C = 
	{
		0x25,
		
		{
			29779
		},
		
		{
			0x2E2E
		},
		
